In [5]:
import pandas as pd

Serires

In [8]:
ser=pd.Series([3,4,5,6,7])
ser

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [9]:
ser2=pd.Series(['aaple','Mango','Graps','Orange'])

In [10]:
ser2

0     aaple
1     Mango
2     Graps
3    Orange
dtype: object

In [11]:
ser2[1:3]

1    Mango
2    Graps
dtype: object

In [12]:
ser3=pd.Series([5,6,7,8,9,1,2,5,12])

In [13]:
ser3

0     5
1     6
2     7
3     8
4     9
5     1
6     2
7     5
8    12
dtype: int64

In [14]:
ser3[2:7]

2    7
3    8
4    9
5    1
6    2
dtype: int64

In [18]:
import pandas as pd

data = [5, 6, 7, 8, 9, 1, 3, 5]
index = ['r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7', 'r8']

ser4 = pd.Series(data, index=index)

In [19]:
print(ser4)

r1    5
r2    6
r3    7
r4    8
r5    9
r6    1
r7    3
r8    5
dtype: int64

In [23]:
df=pd.read_csv('C:\Users\91931\Downloads\archive\employee_data.csv')

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (269974141.py, line 1)

In [30]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,4,6,7]])
df1

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  2  4  6  7

In [25]:
import pandas as pd

data = [[1, 2, 3, 4], [5, 6, 7, 8], [2, 4, 6, 7]]
df1 = pd.DataFrame(data)

In [26]:
df1

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  2  4  6  7

In [31]:
import numpy as np
d={'name':['A','B','C','D','E'],'Age':[19,22,np.nan,18,19],'Gender':['M','F','M','M','W']}

In [32]:
d

{'name': ['A', 'B', 'C', 'D', 'E'],
 'Age': [19, 22, nan, 18, 19],
 'Gender': ['M', 'F', 'M', 'M', 'W']}

In [33]:
df3=pd.DataFrame(d)

In [34]:

df3

  name   Age Gender
0    A  19.0      M
1    B  22.0      F
2    C   NaN      M
3    D  18.0      M
4    E  19.0      W

In [35]:
df3['Salary']=[65000,45000,89006,34567,45678]

In [36]:
df3

  name   Age Gender  Salary
0    A  19.0      M   65000
1    B  22.0      F   45000
2    C   NaN      M   89006
3    D  18.0      M   34567
4    E  19.0      W   45678

In [37]:
df3.Salary

0    65000
1    45000
2    89006
3    34567
4    45678
Name: Salary, dtype: int64

In [38]:
df3.name

0    A
1    B
2    C
3    D
4    E
Name: name, dtype: object

In [39]:
df3.isnull().any()# checking is any null value in our data set

name      False
Age        True
Gender    False
Salary    False
dtype: bool

In [41]:
df3.shape

(5, 4)

In [43]:
df3.drop(['Salary','name'],axis=1)

    Age Gender
0  19.0      M
1  22.0      F
2   NaN      M
3  18.0      M
4  19.0      W

In [44]:
df3

  name   Age Gender  Salary
0    A  19.0      M   65000
1    B  22.0      F   45000
2    C   NaN      M   89006
3    D  18.0      M   34567
4    E  19.0      W   45678

In [46]:
df3.isnull().sum()

name      0
Age       1
Gender    0
Salary    0
dtype: int64

In [47]:
dfd=df3.drop(3,axis=0)

In [49]:
dfd

  name   Age Gender  Salary
0    A  19.0      M   65000
1    B  22.0      F   45000
2    C   NaN      M   89006
4    E  19.0      W   45678

In [50]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   Age     4 non-null      float64
 2   Gender  5 non-null      object
 3   Salary  5 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 288.0+ bytes

In [51]:
df3.describe()  #statical analaytic of your data

             Age        Salary
count   4.000000      5.000000
mean   19.500000  55850.200000
std     1.732051  21547.627531
min    18.000000  34567.000000
25%    18.750000  45000.000000
50%    19.000000  45678.000000
75%    19.750000  65000.000000
max    22.000000  89006.000000

In [52]:
df3.Age.mean()

19.5

In [54]:
df3.Age.median()

19.0

In [56]:
df3.Age=df3.Age.fillna(df3.Age.median())

In [57]:
df3

  name   Age Gender  Salary
0    A  19.0      M   65000
1    B  22.0      F   45000
2    C  19.0      M   89006
3    D  18.0      M   34567
4    E  19.0      W   45678

In [58]:
df3.head()

  name   Age Gender  Salary
0    A  19.0      M   65000
1    B  22.0      F   45000
2    C  19.0      M   89006
3    D  18.0      M   34567
4    E  19.0      W   45678

In [59]:
df3.loc[3]

name          D
Age        18.0
Gender        M
Salary    34567
Name: 3, dtype: object